  ###########예제 8.1##############
  
  ####물리 데이터에 대한 가중회귀분석####
  
  #physics data
  x <- c(0.345,0.287,0.251,0.255,0.207,0.186,0.161,0.132,0.084,0.060)
  y <- c(367,311,295,268,253,239,220,213,193,192)
  w <- c(17,9,9,7,7,6,6,6,5,5)
  
  a <- lm(y~x, weights = w^(-1))    #가중회귀식
  plot(x, y)
  abline(a)
  
  a2 <- lm(y~x+I(x^2), weights = w^(-1))
  plot(x, y)
  lines(x, a2$fitted.values)
  
  matplot(x, cbind(y, a$fittrd.values, a2$fitted.values), 
          type="pll", pch="*", lty=c(1, 2), ylab="y", las=1)    #그림 8.1
  
  
  
  ###########예제 8.2##############
  
  ####사과나무 데이터에 대한 가중회귀분석####
  
  day <- c(0,3,7,13,18,24,25,32,38,42,44,49,52,55,58,61,69,73,76,88,100,106,0,6,9,19,0,6,9,19,27,30,32,34,36,38,40,42,44,48,50,55,58,61,64,67,75,79,82,85,88,91,27,30,32,34,94,97,100,106)
  n <- c(5,5,5,6,5,4,6,5,7,9,10,19,14,11,9,14,10,12,9,7,10,7,5,5,5,11,5,5,5,11,7,8,8,5,6,7,4,3,8,22,7,24,15,12,15,10,14,12,19,5,27,5,7,8,8,5,16,12,10,15)
  ybar <- c(10.2,10.4,10.6,12.5,12,15,15.17,17,18.71,19.22,20,20.32,22.07,22.64,22.78,23.93,25.5,25.08,26.67,28,31.67,32.14,10,11,10,13.36,10,11,10,13.36,14.29,14.5,15.38,16.6,15.5,16.86,17.5,17.33,18,18.46,17.71,19.42,20.6,21,22.33,22.2,23.86,24.42,24.79,25,26.04,26.6,14.29,14.5,15.38,16.6,27.12,26.83,28.7,29.33)
  
  a<-lm(ybar~day, weights = n)
  summary(a)
  plot(day, ybar)
  abline(a)
  
  
  
  ###########예제 8.3##############
  
  ####longley 데이터에 대한 가중회귀분석####
  
  data(longley)
  attach(longley)  

    g <- lm(Employed~GNP+Population, data = longley)
  summary(g)
  cor(GNP, Population)  
  cor(residuals(g)[-1], residuals(g)[-16])
  
  library(nlme)         #nonlinear model
  gl <- gls(Employed~GNP+Population, correlation = corAR1(form = ~Year), data = longley)
                        #generalized least squares method
  summary(gl)  
  intervals(gl)
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  